[
    {
        "id": 1,
        "heading1": "Tomato Bruschetta"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "An iconic Italian starter made with toasted bread, ripe tomatoes, and fresh basil — bursting with flavor and simplicity"  ,
        "img":  "Tomato Bruschetta.jpg"  ,
        "des1":  "To make Bruschetta al Pomodoro, you will need a rustic Italian bread or a baguette sliced into half-inch pieces. You will also need 3 to 4 ripe tomatoes finely diced along with 2 to 3 garlic cloves for rubbing onto the toasted bread. A handful of fresh basil leaves roughly 5 to 6, should be chopped and added to the tomato mixture. For seasoning, use a pinch of salt and black pepper to taste. Drizzle everything with about 2 tablespoons of extra virgin olive oil and optionally finish with a light drizzle of balsamic glaze for added flavor and presentation."   ,
        "des2":  "To make this classic Italian appetizer, start by slicing a baguette or rustic Italian bread into half-inch thick slices. Toast or grill the bread until it becomes golden and slightly crisp on the outside. While the bread is toasting dice 3 to 4 ripe tomatoes and mix them in a bowl with chopped fresh basil a pinch of salt black pepper, and a couple of tablespoons of extra virgin olive oil. Let this mixture sit for a few minutes to allow the flavors to meld together.Once the bread is ready and still warm, take a peeled garlic clove and gently rub one side of each slice to infuse it with a subtle garlic aroma. Next generously spoon the tomato and basil mixture over the toasted slices. For an extra burst of flavor and a touch of sweetness, you can drizzle a bit of balsamic glaze over the top. Serve the bruschetta immediately while the bread is still crisp, and enjoy it as a refreshing and flavorful starter that captures the essence of Italian simplicity."   ,
        "category": "Appetizer"    ,
        "country": "Italy"
    },
    {
        "id": 2,
        "heading1": "Spaghetti Aglio e Olio"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A simple, flavorful pasta made with garlic and olive oil — a classic Italian first course."  ,
        "img":  "Spaghetti Aglio e Olio.jpg"  ,
        "des1":  "For this recipe, you’ll need spaghetti pasta, extra virgin olive oil, several cloves of garlic (thinly sliced), a pinch of red pepper flakes for spice, salt to season the pasta water, and freshly chopped parsley for garnish. Optionally, you can top the dish with grated Parmesan cheese for added richness."   ,
        "des2":  "To prepare Spaghetti Aglio e Olio, begin by boiling a large pot of salted water and cooking the spaghetti until al dente. While the pasta is cooking, heat a generous amount of extra virgin olive oil in a skillet over medium heat. Add thinly sliced garlic cloves and sauté gently until they turn golden and fragrant—be careful not to burn them. For a bit of heat, you can add red pepper flakes to the oil. Once the pasta is ready, reserve a bit of the pasta water, then drain the spaghetti and add it to the skillet with the garlic oil. Toss everything together well, adding a splash of the reserved pasta water to help the sauce cling to the noodles. Finish with freshly chopped parsley and a drizzle of olive oil. Serve hot with grated Parmesan cheese if desired."   ,
        "category": "First Course"    ,
        "country": "Italy"
    },
      {
        "id": 3,
        "heading1": "Chicken Parmigiana"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A crispy breaded chicken cutlet topped with rich tomato sauce and melted cheese — an Italian-American favorite often served with pasta or salad."  ,
        "img":  "Chicken Parmigiana.jpg"  ,
        "des1":  "You’ll need boneless chicken breasts, all-purpose flour, eggs, Italian-style breadcrumbs, grated Parmesan cheese, salt, pepper, olive oil for frying, marinara sauce, fresh mozzarella cheese, and a few basil leaves for garnish. Optional sides include spaghetti, sautéed greens, or roasted vegetables."   ,
        "des2":  "To make Chicken Parmigiana, begin by pounding boneless chicken breasts until they’re evenly thin. Season them with salt and pepper, then dredge each piece in flour, dip it in beaten eggs, and coat it with seasoned breadcrumbs mixed with grated Parmesan cheese. In a skillet, heat some olive oil and pan-fry the breaded chicken on both sides until golden and crispy. Transfer the cutlets to a baking dish. Top each with a generous spoonful of marinara sauce, followed by slices of mozzarella cheese and a sprinkle of Parmesan. Bake in a preheated oven at 200°C (400°F) for about 15–20 minutes, or until the cheese is bubbly and slightly golden. Garnish with fresh basil and serve hot with pasta, roasted vegetables, or a fresh green salad."   ,
        "category": "Main Course"    ,
        "country": "Italy"
    },
   {
        "id": 4,
        "heading1": "Rosemary Roasted Potatoes"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A rustic and flavorful Italian side dish of crispy potatoes roasted with garlic and fresh rosemary."  ,
        "img":  "rosemary roasted potatoes.jpg"  ,
        "des1":  "You’ll need baby potatoes or regular potatoes (cut into chunks), extra virgin olive oil, fresh rosemary (roughly chopped), minced garlic, salt, and freshly ground black pepper. Optional: a sprinkle of Parmesan or chili flakes for extra flavor."   ,
        "des2":  "To prepare Rosemary Roasted Potatoes, start by washing and cutting baby potatoes or regular potatoes into bite-sized chunks — you can peel them or leave the skin on for extra texture. Preheat your oven to 200°C (400°F). In a large bowl, toss the potatoes with extra virgin olive oil, minced garlic, fresh rosemary leaves, salt, and black pepper. Spread them out in a single layer on a baking tray lined with parchment paper. Roast the potatoes in the preheated oven for 30–40 minutes, turning once halfway through, until they are golden, crispy on the outside, and soft inside. Serve hot as a side with grilled meats, chicken, or even on their own with a dip."   ,
        "category": "Side Course"    ,
        "country": "Italy"
    }, 
    {
        "id": 5,
        "heading1": "Classic Tiramisu"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A creamy, coffee-soaked dessert layered with mascarpone and dusted with cocoa — Italy’s most iconic sweet treat."  ,
        "img":  "Classic Tiramisu.jpg"  ,
        "des1":  "You’ll need ladyfinger biscuits (savoiardi), freshly brewed espresso, mascarpone cheese, egg yolks, granulated sugar, heavy whipping cream, unsweetened cocoa powder, and optional dark chocolate for garnishing. A splash of coffee liqueur like Kahlúa or Marsala wine can also be added to the espresso for extra depth."   ,
        "des2":  "To make a classic tiramisu, begin by brewing strong espresso and letting it cool to room temperature. In a mixing bowl, whisk together egg yolks and sugar until pale and creamy, then gently fold in mascarpone cheese until smooth. In a separate bowl, whip cold heavy cream until it forms stiff peaks, and then gently incorporate it into the mascarpone mixture. Quickly dip ladyfinger biscuits (savoiardi) into the espresso — don’t soak them too long, or they’ll become soggy — and layer them in a rectangular dish. Spread half of the mascarpone mixture over the soaked biscuits and smooth it out evenly. Repeat with another layer of dipped ladyfingers and top with the remaining mascarpone. Cover and refrigerate for at least 4–6 hours (overnight is best) to let the flavors develop. Just before serving, generously dust the top with unsweetened cocoa powder and garnish with dark chocolate shavings if desired."   ,
        "category": "Dessert"    ,
        "country": "Italy"
    },
    {
        "id": 6,
        "heading1": "Iced Italian Espresso"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A smooth, chilled espresso drink — bold, slightly sweet, and perfect for warm weather."  ,
        "img":  "Iced Italian Espresso.jpg"  ,
        "des1":  "You’ll need freshly brewed espresso (1–2 shots), ice cubes, granulated sugar (to taste), and a cocktail shaker or jar with a lid for shaking. For extra indulgence, you can top it with a splash of cream or a dusting of cocoa powder."   ,
        "des2":  "To make Caffè Freddo, start by brewing a double shot of strong Italian espresso using an espresso machine or moka pot. While the espresso is still hot, stir in 1 to 2 teaspoons of sugar, depending on how sweet you prefer it. Let it cool slightly, then pour it into a cocktail shaker or a mason jar filled with ice. Shake vigorously for 10–15 seconds — this helps create a light, frothy foam on top. Strain the mixture into a small chilled glass, allowing the foam to sit beautifully over the espresso. Enjoy immediately as a bold, energizing drink perfect for summer afternoons or a stylish coffee break."   ,
        "category": "Beverage"    ,
        "country": "Italy"
    },
    {
        "id": 7,
        "heading1": "Guacamole"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A creamy, zesty dip made with ripe avocados, lime juice, and fresh ingredients — a Mexican favorite served with tortilla chips or tacos."  ,
        "img":  "Guacamole.jpg"  ,
        "des1":  "To make authentic guacamole, you’ll need 2–3 ripe avocados, 1 small finely chopped onion, 1 diced tomato (optional), 1 minced garlic clove, a handful of chopped fresh cilantro, the juice of one lime, and salt to taste. You can also add a finely chopped green chili or jalapeño for some heat."   ,
        "des2":  "Cut the avocados in half, remove the pits, and scoop the flesh into a bowl. Mash the avocado with a fork until it reaches your desired consistency — smooth or slightly chunky. Add the chopped onion, tomato (if using), garlic, cilantro, and lime juice. Mix well and season with salt to taste. For extra flavor, mix in finely chopped green chili or jalapeño. Let the guacamole sit for 10–15 minutes before serving to allow the flavors to blend. Serve with tortilla chips, tacos, or as a side to your favorite Mexican dish."   ,
        "category": "Appetizer"    ,
        "country": "Mexico"
    },
    {
        "id": 8,
        "heading1": "Mexican Street Corn"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A flavorful, smoky, and creamy corn-on-the-cob dish sold by street vendors all over Mexico."  ,
        "img":  "Mexican Street Corn.jpg"  ,
        "des1":  "To make Elote, you’ll need 4 ears of fresh corn, ½ cup of mayonnaise, ½ cup of crumbled Cotija cheese (or feta as a substitute), 1 teaspoon chili powder, 1 tablespoon fresh lime juice, and a pinch of salt. Optional toppings include chopped cilantro, paprika, or extra lime wedges for serving."   ,
        "des2":  "Grill the corn over medium-high heat until it’s nicely charred on all sides, turning occasionally for about 10 minutes. While the corn is still hot, brush each ear generously with mayonnaise. Sprinkle a thick layer of crumbled Cotija cheese on top, followed by a dash of chili powder and a squeeze of fresh lime juice. Add a pinch of salt to taste and garnish with chopped cilantro if desired. Serve hot, with lime wedges on the side for an extra zesty kick."   ,
        "category": "First Course"    ,
        "country": "Mexico"
    },
    {
        "id": 9,
        "heading1": "Chicken Enchiladas"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "Soft corn tortillas filled with shredded chicken, smothered in rich red enchilada sauce, and topped with melted cheese — a comforting and flavorful Mexican main dish."  ,
        "img":  "Chicken Enchiladas.jpg"  ,
        "des1":  "You’ll need 2 cups of cooked and shredded chicken breast, 8–10 corn tortillas, 2 cups of red enchilada sauce (store-bought or homemade), 1½ cups of shredded cheese (like Monterey Jack or cheddar), ½ cup of chopped onion, 2 tablespoons of oil, and salt and pepper to taste. Optional toppings include sour cream, sliced avocado, chopped cilantro, and lime wedges."   ,
        "des2":  "Preheat your oven to 180°C (350°F). Lightly warm the tortillas in a skillet or microwave to prevent cracking. In a bowl, mix the shredded chicken with half of the enchilada sauce and season with salt and pepper. Lightly grease a baking dish, then fill each tortilla with the chicken mixture, roll it tightly, and place it seam-side down in the dish. Once all enchiladas are arranged, pour the remaining sauce evenly over them and top with shredded cheese. Cover with foil and bake for about 20 minutes, then uncover and bake an additional 5–10 minutes until the cheese is bubbly and golden. Serve hot, garnished with sour cream, cilantro, and lime wedges."   ,
        "category": "Main Course"    ,
        "country": "Mexico"
    },
    {
        "id": 10,
        "heading1": "Mexican Rice"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A fluffy, tomato-infused rice side dish seasoned with garlic, onion, and spices — a must-have on any traditional Mexican plate."  ,
        "img":  "Mexican Rice.jpg"  ,
        "des1":  "To make Mexican rice, you’ll need 1 cup of long-grain white rice, 2 tablespoons of oil, 1 small onion (finely chopped), 2 cloves of garlic (minced), 1 ½ cups of chicken broth (or water), ½ cup of tomato sauce (or 2 blended tomatoes), ½ teaspoon of cumin, and salt to taste. Optional ingredients include peas, carrots, or corn for added texture."   ,
        "des2":  "In a medium saucepan, heat the oil over medium heat and add the rice. Stir continuously for 5–7 minutes until the rice is lightly golden and aromatic. Add the chopped onion and garlic and cook for another 1–2 minutes until softened. Stir in the tomato sauce, chicken broth, cumin, and salt. Bring the mixture to a boil, then reduce the heat to low, cover with a lid, and let it simmer for about 18–20 minutes, or until the liquid is absorbed and the rice is tender. Turn off the heat and let the rice sit covered for 5 minutes before fluffing with a fork. Serve warm as a flavorful side with any Mexican dish."   ,
        "category": "Side Course"    ,
        "country": "Mexico"
    },
    {
        "id": 11,
        "heading1": "Mexican Caramel Custard"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A fluffy, tomato-infused rice side dish seasoned with garlic, onion, and spices — a must-have on any traditional Mexican plate."  ,
        "img":  "Mexican Caramel Custard.jpg"  ,
        "des1":  "To make traditional flan, you’ll need 1 cup of granulated sugar for the caramel, 1 can (14 oz) of sweetened condensed milk, 1 can (12 oz) of evaporated milk, 3 large eggs, 1 tablespoon of vanilla extract, and a pinch of salt. You’ll also need a round baking dish and a water bath setup for even baking.."   ,
        "des2":  "Start by preparing the caramel: In a saucepan over medium heat, melt the sugar while stirring constantly until it turns into a golden brown liquid. Quickly pour the caramel into the bottom of your baking dish, swirling it to coat the base evenly before it hardens. In a large mixing bowl, whisk together the sweetened condensed milk, evaporated milk, eggs, vanilla extract, and salt until smooth and well combined. Pour the custard mixture over the hardened caramel. Place the baking dish in a larger pan and fill the outer pan with hot water to create a water bath. Bake at 175°C (350°F) for about 50–60 minutes, or until the center is set and a toothpick comes out clean. Allow it to cool completely, then refrigerate for at least 4 hours. To serve, run a knife around the edges and invert onto a plate to reveal the glossy caramel topping."   ,
        "category": "Dessert"    ,
        "country": "Mexico"
    },
    {
        "id": 12,
        "heading1": "Hibiscus Iced Tea"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A tart, ruby-red drink made from dried hibiscus petals — naturally vibrant, tangy, and perfect for cooling off on warm days."  ,
        "img":  "Hibiscus Iced Tea.jpg"  ,
        "des1":  "o make Agua de Jamaica, you’ll need 1 cup of dried hibiscus flowers (available at most Latin markets or online), 4 cups of water for boiling, 3–4 tablespoons of sugar (adjust to taste), an additional 2 cups of cold water, and optional ingredients like cinnamon sticks, lime juice, or orange slices for extra flavor and garnish."   ,
        "des2":  "In a medium saucepan, bring 4 cups of water to a boil. Add the dried hibiscus petals (and cinnamon stick if using), then reduce the heat and simmer for about 10 minutes until the water is a deep red color. Remove from heat, strain the liquid into a pitcher using a fine sieve or cheesecloth, and discard the used flowers. While the tea is still warm, stir in the sugar until dissolved. Let the concentrate cool to room temperature, then add 2 more cups of cold water and stir well. Taste and adjust sweetness or add a splash of lime juice if desired. Chill in the refrigerator and serve over ice, garnished with orange or lime slices for a citrusy twist."   ,
        "category": "Beverage"    ,
        "country": "Mexico"
    },
    {
        "id": 13,
        "heading1": "Chinese Vegetable Spring Rolls"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A crispy and flavorful appetizer filled with stir-fried veggies and served with sweet chili sauce. Perfect for starting any meal!"  ,
        "img":  "Chinese Vegetable Spring Rolls.jpg"  ,
        "des1":  "To make vegetable spring rolls, you’ll need spring roll wrappers, shredded cabbage, julienned carrots, bean sprouts, thinly sliced bell peppers, chopped green onions, garlic, soy sauce, sesame oil, and a pinch of ground black pepper. For frying, use vegetable oil, and serve with your favorite dipping sauce like sweet chili or soy garlic."   ,
        "des2":  "Begin by heating a tablespoon of oil in a pan over medium heat. Sauté the garlic until fragrant, then add all the vegetables and stir-fry for about 3–4 minutes until just tender. Season with soy sauce, sesame oil, and black pepper. Let the mixture cool completely. Place a spoonful of filling on each spring roll wrapper, fold the sides, roll tightly, and seal the edge with a dab of water. Heat oil in a deep pan and fry the rolls until golden brown and crispy. Drain on paper towels and serve hot with sweet chili sauce."   ,
        "category": "Appetizer"    ,
        "country": "China"
    },
    {
        "id": 14,
        "heading1": "Hot and Sour Soup"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A warming, tangy, and spicy soup that stimulates the appetite and sets the tone for a hearty Chinese meal."  ,
        "img":  "Hot and Sour Soup.jpg"  ,
        "des1":  "To make hot and sour soup, you will need sliced shiitake or wood ear mushrooms, bamboo shoots, firm tofu cut into thin strips, chicken or vegetable stock, soy sauce, rice vinegar, white pepper, and cornstarch for thickening. You’ll also need beaten eggs, chopped green onions, sesame oil, and optionally cooked shredded chicken or pork for added protein."   ,
        "des2":  "Start by heating the stock in a pot and adding mushrooms, bamboo shoots, and tofu. Season with soy sauce, vinegar, and a generous pinch of white pepper for heat. Let it simmer for 5–7 minutes. Mix cornstarch with a bit of cold water and stir it into the soup to thicken slightly. Slowly drizzle in the beaten egg while stirring gently to create silky egg ribbons. Finally, stir in sesame oil and garnish with chopped green onions. Serve hot as a flavorful first course to your Chinese feast."   ,
        "category": "First Course"    ,
        "country": "China"
    },
    {
        "id": 15,
        "heading1": "Kung Pao Chicken"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A bold and savory stir-fry featuring tender chicken, crunchy peanuts, and a spicy-sweet sauce — a signature dish from Sichuan cuisine."  ,
        "img":  "Kung Pao Chicken.jpg"  ,
        "des1":  "To prepare Kung Pao Chicken, you’ll need boneless chicken breast or thighs cut into bite-sized pieces, diced bell peppers, chopped green onions, dry red chilies, roasted peanuts, garlic, and ginger. For the marinade and sauce, use soy sauce, hoisin sauce, rice vinegar, sugar, cornstarch, sesame oil, and a bit of water or chicken broth to adjust the consistency."   ,
        "des2":  "Begin by marinating the chicken in a mixture of soy sauce, cornstarch, and sesame oil for about 20 minutes. In a hot wok or large skillet, heat oil and briefly fry the dried red chilies until fragrant. Add the marinated chicken and stir-fry until lightly browned. Toss in the garlic, ginger, and bell peppers, cooking for a few minutes more. Pour in the sauce mixture and let it simmer until thickened and the chicken is fully cooked. Stir in the roasted peanuts and green onions just before serving. Serve hot with steamed jasmine rice or fried rice for a satisfying main course."   ,
        "category": "Main Course"    ,
        "country": "China"
    },
    {
        "id": 16,
        "heading1": "Vegetable Fried Rice"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A colorful and flavorful rice dish stir-fried with fresh vegetables — the perfect companion to any Chinese main course."  ,
        "img":  "Vegetable Fried Rice.jpg"  ,
        "des1":  "To prepare vegetable fried rice, you’ll need cooked and cooled white rice (preferably a day old), finely chopped carrots, green peas, bell peppers, sweet corn, and green onions. You’ll also need minced garlic, soy sauce, sesame oil, and a little vegetable oil for frying. Optionally, add a dash of white pepper or chili flakes for extra flavor."   ,
        "des2":  "Start by heating oil in a large wok or nonstick pan over medium-high heat. Sauté the garlic until fragrant, then add the chopped vegetables and stir-fry for a few minutes until just tender but still crisp. Add the cold rice, breaking apart any clumps, and mix everything thoroughly. Drizzle in soy sauce and a few drops of sesame oil, stirring continuously to coat the rice evenly. Cook for 3–4 more minutes until heated through and lightly toasted. Garnish with chopped green onions and serve warm as a savory side course to complete your Chinese meal."   ,
        "category": "Side Course"    ,
        "country": "China"
    },
    {
        "id": 17,
        "heading1": "Sesame Balls"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A crispy, chewy, and sweet Chinese dessert with a golden sesame crust and a soft red bean paste center — a favorite during festivals and dim sum."  ,
        "img":  "Sesame-Balls.jpg"  ,
        "des1":  "To make sesame balls, you’ll need glutinous rice flour, water, sugar, and white sesame seeds. For the filling, use sweet red bean paste (available at Asian stores or homemade). You’ll also need oil for deep-frying and a small bowl of water to help with sealing and rolling."   ,
        "des2":  "Start by mixing glutinous rice flour with a little sugar and warm water to form a smooth, pliable dough. Divide the dough into small balls, then flatten each one and place a spoonful of red bean paste in the center. Carefully wrap the dough around the filling, sealing it into a smooth ball. Dip each ball lightly in water, then roll it in sesame seeds until fully coated. Heat oil in a deep pan over medium heat and fry the sesame balls until they puff up and turn golden brown, gently stirring to ensure even cooking. Remove and drain on paper towels. Serve warm and enjoy the crispy exterior with the gooey sweet center."   ,
        "category": "Dessert"    ,
        "country": "China"
    },
    {
        "id": 18,
        "heading1": " Chrysanthemum Tea"  ,
        "heading2": "Ingredients:"    ,
        "heading3": "Instructions:"       ,
        "paragraph":  "A light, floral, and caffeine-free Chinese herbal tea traditionally enjoyed for its cooling properties and delicate aroma."  ,
        "img":  "Chrysanthemum-Tea.jpg"  ,
        "des1":  "To make chrysanthemum tea, you’ll need dried chrysanthemum flowers (commonly available at Asian grocery stores), hot water, and optionally rock sugar or honey for sweetness. You can also add a few goji berries or red dates for a richer flavor and extra health benefits."   ,
        "des2":  "Begin by rinsing the dried chrysanthemum flowers briefly under cold water to remove any dust. Place about 6–8 flowers in a teapot or cup. Pour freshly boiled water (that has cooled slightly for about 1 minute) over the flowers and let them steep for 3–5 minutes, or until the tea turns a pale golden yellow. Add a bit of rock sugar or honey if desired, and strain before serving. This tea is not only soothing but also known in traditional Chinese medicine for its calming and cooling effects — perfect with dim sum or after a spicy meal."   ,
        "category": "Beverage"    ,
        "country": "China"
    }
]